# 练习:
#   用循环语句实现打印三角形.输入一个整数，代表三角形的宽度和高度,打印出相应的三角形
#     1) 如:
#        请输入三角形的宽度: 4
#     打印结果如下:
#       *
#       **
#       ***
#       ****
#     2) 如:
#        请输入三角形的宽度: 4
#     打印结果如下:
#          *
#         **
#        ***
#       ****
#     3) 如:
#        请输入三角形的宽度: 4
#     打印结果如下:
#       ****
#        ***
#         **
#          *
#     4) 如:
#        请输入三角形的宽度: 4
#     打印结果如下:
#       ****
#       ***
#       **
#       *

n = int(input('请输入三角形的宽度: '))

print('-----------1-----------')
for i in range(1, n + 1):  # i 代表行数
    print('*' * i)

print('-----------2-----------')
for i in range(1, n + 1):
    stars = i  # 星的个数
    banks = n - stars  # 空格个数
    print(' ' * banks + '*' * stars)

print('-----------3-----------')
for stars in range(n, 0, -1):
    banks = n - stars  # 空格个数
    print(' ' * banks + '*' * stars)

print('-----------4-----------')
for stars in range(n, 0, -1):
    print('*' * stars)


